// Задача 4: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
int приглашение(строковое сообщение)
{
    Console.WriteLine(сообщение);
    string text = Console.ReadLine();
    int number = int.Parse(текст);
    возвращаемый номер;
}

int num = prompt("Введите число для дня недели");
if (num < 1 || num > 7) { Console.WriteLine("В неделе всего 7 дней"); }
ещё
{
    if (num < 6) { Console.WriteLine("Это рабочийдень"); }
    else { { Console.WriteLine("Это выходные"); } }
}